Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes
The ClosedGraphicObjectAttributes class is the attributes class for the closed graphic object.

Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes.Hatch
The hatch attributes of the closed graphic object (the closed graphic object is hatchable).

Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes.BehindModelObjects
Gets or sets whether the closed graphic object is drawn behind model objects

Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes.#ctor
Creates a new closed graphic object attributes instance.

Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes.#ctor(System.String)
Creates a new closed graphic object attributes instance using the given attribute file.
AttributeFile: The attribute file to be used.

Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes.LoadAttributes(System.String,Tekla.Structures.Drawing.DrawingObject.ObjectTypes)
Loads attributes from attribute file for the specified Type of object.
AttributeFile: Attribute filename.
ObjectType: The type of object to load attributes for.
Returns: Returns true if attributes are loaded correctly. Returns false if attribute file loading failed.